package question201;

/**
 * @author: ymm
 * @date: 2021/7/4
 * @version: 1.0.0
 * @description:
 */
public class Question201 {
    /**
     2.1.2
     选择排序中一个元素最多可能被交换N次，平均交换1次
     例如： 5 1 2 3 4

     排序前：5 1 2 3 4
     i= 0,min= 1    1 5 2 3 4
     i= 1,min= 2    1 2 5 3 4
     i= 2,min= 3    1 2 3 5 4
     i= 3,min= 4    1 2 3 4 5
     i= 4,min= 4    1 2 3 4 5
     排序后：1 2 3 4 5

     2.1.3
     构造的数组是：5 1 2 3 4

     2.1.6 所有主键都相同时，选择排序和插入排序谁更快？
        选择排序比插入排序快，插入排序要移动的次数比选择排序多。

     2.1.7 逆序数组选择排序比插入排序快，因为插入排序需要移动的次数更多。

     2.1.8

     2.1.10 希尔排序中为什么在实现h有序时不使用选择排序？
        排序之初，各个子数组都很短，排序之后子数组都是部分有序。这两种情况都很适合插入排序。

     2.1.13

        1.

     */


}
